<a href="https://colab.research.google.com/github/daniellepatricio/Analise-de-Dados_Pandas_Python/blob/main/trabalhando_planilhas_excel.ipynb" target="_parent"><img src="https://colab.research.google.com/assets/colab-badge.svg" alt="Open In Colab"/></a>

In [2]:

# Importando a biblioteca
import pandas as pd

In [5]:
# Leitura dos arquivos
df1 = pd.read_excel("Aracaju.xlsx")
df2 = pd.read_excel("Fortaleza.xlsx")
df3 = pd.read_excel("Natal.xlsx")
df4 = pd.read_excel("Recife.xlsx")
df5 = pd.read_excel("Salvador.xlsx")

In [6]:
#Ler estrutura do arquivo Aracaju.xlsx
df1.head()

    Cidade       Data  Vendas  LojaID  Qtde
0  Aracaju 2018-01-01  142.00    1520     1
1  Aracaju 2018-01-01   14.21    1522     6
2  Aracaju 2018-01-01   71.55    1520     1
3  Aracaju 2018-01-01    3.01    1521     7
4  Aracaju 2018-01-01   24.51    1522     8

In [7]:
# Concatenar todos os arquivos
df = pd.concat([df1, df2, df3, df4, df5])

In [8]:
#Leitura das 5 primeiras linhas das planilhas concatenadas
df.head()

    Cidade       Data  Vendas  LojaID  Qtde
0  Aracaju 2018-01-01  142.00    1520     1
1  Aracaju 2018-01-01   14.21    1522     6
2  Aracaju 2018-01-01   71.55    1520     1
3  Aracaju 2018-01-01    3.01    1521     7
4  Aracaju 2018-01-01   24.51    1522     8

In [9]:
#Leitura das 5 últimas linhas das planilhas concatenadas
df.tail()

       Cidade       Data  Vendas  LojaID  Qtde
235  Salvador 2019-01-03   41.84    1034     1
236  Salvador 2019-01-03  126.29    1035     3
237  Salvador 2019-01-03   38.06    1036     3
238  Salvador 2019-01-03  139.64    1035     1
239  Salvador 2019-01-03  161.41    1037     3

In [10]:
# Amostra do conjunto de dados
df.sample(5)

       Cidade       Data  Vendas  LojaID  Qtde
85    Aracaju 2018-01-01   15.17    1521     1
26   Salvador 2019-01-01  183.45    1036     3
104    Recife 2019-01-01   40.11     983     5
163     Natal 2019-01-02   17.66    1036     3
22      Natal 2018-06-21  621.00     853     3

In [11]:
#Verificar o tipo de dados de cada coluna
df.dtypes

Cidade            object
Data      datetime64[ns]
Vendas           float64
LojaID             int64
Qtde               int64
dtype: object

In [12]:
#Alterar o tipo de dados da coluna LojaID
df["LojaID"] = df["LojaID"].astype("object")

In [13]:
#Verificar o tipo de dados de cada coluna
df.dtypes

Cidade            object
Data      datetime64[ns]
Vendas           float64
LojaID            object
Qtde               int64
dtype: object

In [14]:
#Leitura das 5 primeiras linhas das planilhas concatenadas
df.head()

    Cidade       Data  Vendas LojaID  Qtde
0  Aracaju 2018-01-01  142.00   1520     1
1  Aracaju 2018-01-01   14.21   1522     6
2  Aracaju 2018-01-01   71.55   1520     1
3  Aracaju 2018-01-01    3.01   1521     7
4  Aracaju 2018-01-01   24.51   1522     8

**TRATANDO VALORES FALTANTES:**

In [15]:
# Consultar linhas com valores faltantes
df.isnull().sum()

Cidade    0
Data      0
Vendas    0
LojaID    0
Qtde      0
dtype: int64

In [16]:
#Média de vendas
df["Vendas"].mean()

122.61180089485438

In [17]:
# Substituir os valores nulos pela média
df["Vendas"].fillna(df["Vendas"].mean(), inplace=True)

In [18]:
# Consultar linhas com valores faltantes
df.isnull().sum()

Cidade    0
Data      0
Vendas    0
LojaID    0
Qtde      0
dtype: int64

In [19]:
#Pegar amostra de 15 linhas
df.sample(15)

        Cidade       Data  Vendas LojaID  Qtde
31       Natal 2018-04-03  401.00    854     4
8      Aracaju 2019-01-01   12.16   1523     1
94      Recife 2019-01-01   24.70    982     3
56      Recife 2019-01-01    7.98    983     5
202      Natal 2019-01-02   22.45   1036     1
115  Fortaleza 2019-03-02   12.23    981     3
89       Natal 2019-01-02   17.46   1034     1
60   Fortaleza 2019-01-01  182.14   1002     4
79     Aracaju 2018-01-01    5.59   1521     4
74      Recife 2019-01-01   38.79    983     6
39   Fortaleza 2019-01-01  176.51   1005     1
19     Aracaju 2018-01-01   43.96   1520     9
31    Salvador 2019-01-01  202.25   1035     2
7       Recife 2019-02-11   33.37    982     3
23     Aracaju 2018-01-01  237.50   1523     7

In [20]:
# Substituir os valores nulos por zero
df["Vendas"].fillna(0, inplace=True)

In [24]:
#Apagar linhas com valores nulos
df.dropna(inplace=True)

In [21]:
# Apagar linhas com valores nulos com base apenas em uma coluna
df.dropna(subset=["Vendas"], inplace=True)

In [22]:
# Remover linhas que estejam com valores faltantes em todas as colunas
df.dropna(how="all", inplace=True)

**CRIANDO COLUNAS NOVAS:**

In [25]:
# Criando a coluna de receita
df["Receita"] = df["Vendas"].mul(df["Qtde"])

In [26]:
#Leitura das 5 primeiras linhas das planilhas concatenadas
df.head()

    Cidade       Data  Vendas LojaID  Qtde  Receita
0  Aracaju 2018-01-01  142.00   1520     1   142.00
1  Aracaju 2018-01-01   14.21   1522     6    85.26
2  Aracaju 2018-01-01   71.55   1520     1    71.55
3  Aracaju 2018-01-01    3.01   1521     7    21.07
4  Aracaju 2018-01-01   24.51   1522     8   196.08

In [27]:
# Criando a coluna de receita/ vendas (quantidade de produtos vendidos)
df["Receita/Vendas"] = df["Receita"] / df["Vendas"]

In [28]:
#Leitura das 5 primeiras linhas das planilhas concatenadas
df.head()

    Cidade       Data  Vendas LojaID  Qtde  Receita  Receita/Vendas
0  Aracaju 2018-01-01  142.00   1520     1   142.00             1.0
1  Aracaju 2018-01-01   14.21   1522     6    85.26             6.0
2  Aracaju 2018-01-01   71.55   1520     1    71.55             1.0
3  Aracaju 2018-01-01    3.01   1521     7    21.07             7.0
4  Aracaju 2018-01-01   24.51   1522     8   196.08             8.0

In [29]:
# Retornar a maior receita
df["Receita"].max()

3544.0

In [30]:
# Retornar a menor receita
df["Receita"].min()

3.34

In [31]:
# Retornar as 3 maiores receitas
df.nlargest(3, "Receita")

   Cidade       Data  Vendas LojaID  Qtde  Receita  Receita/Vendas
7   Natal 2019-03-18   886.0    853     4   3544.0             4.0
51  Natal 2018-01-21   859.0    852     4   3436.0             4.0
55  Natal 2019-01-08   859.0    854     4   3436.0             4.0

In [32]:
# Retornar as 3 menores receitas
df.nsmallest(3, "Receita")

      Cidade       Data  Vendas LojaID  Qtde  Receita  Receita/Vendas
118  Aracaju 2018-01-01    3.34   1522     1     3.34             1.0
65    Recife 2019-01-01    4.01    981     1     4.01             1.0
92     Natal 2019-01-02    4.57   1035     1     4.57             1.0

In [33]:
# Agrupar por cidade
df.groupby("Cidade")["Receita"].sum()

Cidade
Aracaju       48748.25
Fortaleza     37913.97
Natal        167227.52
Recife        51936.51
Salvador      40596.73
Name: Receita, dtype: float64

In [34]:
# Ordenar o conjunto de dados
df.sort_values("Receita", ascending=False).head(10)

   Cidade       Data  Vendas LojaID  Qtde  Receita  Receita/Vendas
7   Natal 2019-03-18   886.0    853     4   3544.0             4.0
55  Natal 2019-01-08   859.0    854     4   3436.0             4.0
51  Natal 2018-01-21   859.0    852     4   3436.0             4.0
30  Natal 2018-10-02   856.0    853     4   3424.0             4.0
41  Natal 2018-05-20   835.0    852     4   3340.0             4.0
38  Natal 2018-02-25   828.0    852     4   3312.0             4.0
10  Natal 2018-10-27   828.0    852     4   3312.0             4.0
69  Natal 2019-03-24   817.0    852     4   3268.0             4.0
62  Natal 2018-02-10   793.0    854     4   3172.0             4.0
52  Natal 2018-04-27   778.0    854     4   3112.0             4.0